app/views/students/index.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= student.activated %></td>
        <td><%= student.group.name %></td>