app/views/students/show.html.erb

        <%if @student.group_id!=nil%>
        <p><%= @student.group.name %></p>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]