app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "PS41"], ["teacher_id", 1], ["created_at", 2017-04-02 17:39:19 UTC], ["updated_at", 2017-04-02 17:39:19 UTC]]

  def update
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]