app/controllers/marks_controller.rb

  def index
    if current_user.admin?
    @marks = Mark.all
  else
    @marks = Mark.where(student_id:User.find(current_user))
---
SELECT "marks".* FROM "marks"
SELECT "marks".* FROM "marks" WHERE "marks"."student_id" = ?  [["student_id", 0]]

  def create
    @mark = Mark.new(mark_params)

    respond_to do |format|
      if @mark.save
---
INSERT INTO "marks" ("mark", "student_id", "created_at", "updated_at", "subject_id") VALUES (?, ?, ?, ?, ?)  [["mark", 4], ["student_id", 3], ["created_at", 2017-04-09 19:24:20 UTC], ["updated_at", 2017-04-09 19:24:20 UTC], ["subject_id", 1]]

  def destroy
    @mark.destroy
---
DELETE FROM "marks" WHERE "marks"."id" = ?  [["id", 7]]

    def set_mark
      @mark = Mark.find(params[:id])
---
SELECT  "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]