app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "birthday", "education", "activated", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]