app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "hour", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "math"], ["hour", 50], ["created_at", 2017-04-03 08:58:34 UTC], ["updated_at", 2017-04-03 08:58:34 UTC]]

    def set_subject
      @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]