app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def index
    @teachers = Teacher.all

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @teacher = Teacher.find(params[:id])

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @teacher = Teacher.find(params[:id])

INSERT INTO "teachers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Olesya Kots"], ["created_at", 2017-04-02 17:38:38 UTC], ["updated_at", 2017-04-02 17:38:38 UTC]]
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "teachers" SET "name" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["name", "Трембовецька Тетяна Василівна"], ["updated_at", 2017-04-09 19:39:25 UTC], ["id", 4]]
---
  def update
    @teacher = Teacher.find(params[:id])
    respond_to do |format|
      if @teacher.update(teacher_params)

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 1]]
---
  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy