app/controllers/users_controller.rb

  def index
      @users = User.where(activated: false).paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", false], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", false]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "name", "email", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$gUQwlXXpM4Tmshbdc78JzuXpOODO0joNO8DibWqBzPUn0bTIGyR2a"], ["updated_at", 2017-04-05 08:56:22 UTC], ["id", 1]]

  def deactivate
  user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def activate
  user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]